{"HR_MCQ": {"You are a team leader and notice that one of your team members is consistently missing deadlines. How do you handle the situation?": {"A": "Confront the team member in front of everyone and ask why they are not meeting deadlines", "B": "Ignore the issue and hope it resolves itself", "C": "Schedule a private meeting with the team member to discuss the issue and work together to find a solution", "D": "Assign more tasks to the team member to keep them bus", "Answer": "C"}, "A coworker approaches you and tells you that they are feeling overwhelmed and stressed out. What do you do?": {"A": "Listen to the coworker and offer support and resources to help manage their stress", "B": "Suggest that the coworker take some time off to relax", "C": "Tell the coworker to toughen up and deal with it", "D": "Ignore the coworker and continue with your work", "Answer": "A"}, "You receive a work assignment that you have never done before and are unsure how to proceed. What do you do?": {"A": "Turn in a half-hearted attempt and hope for the best", "B": "Ask your coworker to do the assignment for you", "C": "Give up and don't complete the assignment", "D": "Seek guidance from your supervisor or a more experienced colleague", "Answer": "D"}, "You are in a meeting with a colleague who keeps interrupting and talking over you. What do you do?": {"A": "Talk louder and try to talk over your colleague", "B": "Politely ask your colleague to let you finish speaking before they respond", "C": "Ignore the behavior and hope it stops on its own", "D": "Call out your colleague and tell them to stop interrupting", "Answer": "B"}, "A coworker approaches you with a complaint about another coworker. What do you do?": {"A": "Listen to the complaint and offer support, but encourage the coworker to bring the issue to a supervisor", "B": "Tell the coworker to stop complaining and focus on their own work", "C": "Confront the other coworker about the complaint and try to resolve the issue", "D": "Ignore the complaint and tell the coworker to deal with it themselves", "Answer": "A"}}, "Tech_MCQ": {"What is the difference between batch gradient descent and stochastic gradient descent in machine learning?": {"A": "Batch gradient descent updates the parameters after computing the gradients on the entire dataset, while stochastic gradient descent updates the parameters after computing the gradients on a single data point.", "B": "Batch gradient descent updates the parameters after computing the gradients on a random subset of the dataset, while stochastic gradient descent updates the parameters after computing the gradients on the entire dataset.", "C": "Batch gradient descent updates the parameters after computing the gradients on a single data point, while stochastic gradient descent updates the parameters after computing the gradients on the entire dataset.", "D": "Batch gradient descent and stochastic gradient descent are the same thing.", "Answer": "A"}, "What is the purpose of dropout regularization in deep learning?": {"A": "To randomly select a subset of features to use in the model during training", "B": "To prevent overfitting by randomly dropping out neurons during training", "C": "To increase the number of layers in a deep neural network", "D": "To decrease the learning rate during training", "Answer": "B"}, "What is the purpose of the activation function in a neural network?": {"A": "To determine the learning rate during training", "B": "To normalize the input data", "C": "To perform feature selection on the input data", "D": "To introduce nonlinearity into the model", "Answer": "D"}, "What is the difference between L1 and L2 regularization in machine learning?": {"A": "L1 regularization penalizes the absolute value of the weights, while L2 regularization penalizes the squared value of the weights.", "B": "L1 regularization penalizes the squared value of the weights, while L2 regularization penalizes the absolute value of the weights.", "C": "L1 regularization penalizes the number of non-zero weights, while L2 regularization penalizes the sum of the squared weights.", "D": "L1 regularization and L2 regularization are the same thing.", "Answer": "A"}, "What is the purpose of the softmax function in deep learning?": {"A": "To perform feature selection on the input data", "B": "To introduce nonlinearity into the mode", "C": "To convert the output of a neural network into a probability distribution over multiple classes", "D": "To normalize the input data", "Answer": "C"}}, "HR_Desc": {"Tell me about yourself?": {}, "What are your weakness and strength?": {}, "Where do you see yourself in 5 years?": {}}}